---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.ViewPrintingEventArgs
source: html/35cdde0a-c5d0-90ea-aed1-43bed0b5752b.htm
---
# ViewPrintingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.